In [144]:
import pandas as pd
import numpy as np

In [145]:
file = "Resources/purchase_data.csv"

data_df = pd.read_csv(file)
data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Purchasing Analysis
This data set shows that 576 players purchased at least one of the 183 unique items available in Heroes of Pymoli. All of the items were purchased at least once, and there were 780 transactions overall.

In [157]:
overall = pd.DataFrame({
    "Purchasing Users": ["576"],
    "No. of Unique Items": ["183"],
    "Avg. Purchase": ["$3.05"],
    "No. of Purchases": ["780"],
    "Total Purchases": ["$2,379.77"]
})
overall

,Purchasing Users,No. of Unique Items,Avg. Purchase,No. of Purchases,Total Purchases
0,576,183,$3.05,780,"$2,379.77"

In [147]:
data_df["SN"].nunique()

576

In [148]:
data_df["Price"].describe()

count    780.000000
mean       3.050987
std        1.169549
min        1.000000
25%        1.980000
50%        3.150000
75%        4.080000
max        4.990000
Name: Price, dtype: float64

In [149]:
price_total = data_df["Price"].sum()

In [151]:
average_pur = price_total / 780
average_pur

3.0509871794871795

In [137]:
data_df["Item ID"].value_counts().head()

178    12
82      9
108     9
145     9
92      8
Name: Item ID, dtype: int64

In [9]:
data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Gender Analysis
The gender breakdown of purchasing players is 484 males (84 percent), 81 females (14 percent), and 11 other/non-disclosed (2 percent). The purchasing data from each category is shown in the chart below. Spending closely tracked the gender breakdown, with male spending making up nearly 83 percent of the overall total.

In [152]:
gender_breakdown_df = pd.DataFrame({
    "Gender": ["Male", "Female", "Other/Non-Disclosed"],
    "No. of Purchases": ["652", "113", "15"],
    "Total Purchases Amount": ["$1,967.64", "$361.94", "$50.19"],
    "Avg. Purchase": ["$3.18", "$3.20", "$3.35"],
    "Avg. Purchase Per Person": ["$4.07", "$4.47", "4.56"]
})
gender_breakdown_df

,Gender,No. of Purchases,Total Purchases Amount,Avg. Purchase,Avg. Purchase Per Person
0,Male,652,"$1,967.64",$3.18,$4.07
1,Female,113,$361.94,$3.20,$4.47
2,Other/Non-Disclosed,15,$50.19,$3.35,4.56

In [11]:
gender_df = data_df.drop_duplicates(subset="SN", keep="first")
gender_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [12]:
gender_df["SN"].count()

576

In [13]:
gender_df["Gender"].value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [14]:
gender_df["Gender"].value_counts(normalize=True)

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [15]:
male_purchase_df = data_df[data_df["Gender"] == "Male"]
male_purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [16]:
male_purchase_df["Purchase ID"].count()

652

In [17]:
male_purchase_df["Price"].sum()

1967.64

In [18]:
male_purchase_df["Price"].mean()

3.0178527607361953

In [19]:
male_pp = male_purchase_df["Price"].sum() / 484
male_pp

4.065371900826446

In [20]:
female_purchase_df = data_df[data_df["Gender"] == "Female"]
female_purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [21]:
female_purchase_df["Purchase ID"].count()

113

In [22]:
female_purchase_df["Price"].sum()

361.94

In [23]:
female_purchase_df["Price"].mean()

3.203008849557519

In [24]:
female_purchase_df["SN"].nunique()

81

In [25]:
female_pp = female_purchase_df["Price"].sum() / 81
female_pp

4.468395061728395

In [26]:
other_purchase_df = data_df[data_df["Gender"] == "Other / Non-Disclosed"]
other_purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [27]:
other_purchase_df["Purchase ID"].count()

15

In [28]:
other_purchase_df["Price"].sum()

50.19

In [29]:
other_purchase_df["Price"].mean()

3.3460000000000005

In [30]:
other_purchase_df["SN"].nunique()

11

In [31]:
other_purchase_df["Price"].sum() / 11

4.5627272727272725

In [33]:
data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [34]:
data_df["Age"].max()

45

In [35]:
data_df["Age"].min()

7

In [36]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 44, 49]
labels = ["Under 10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40-44", "45-49"]
data_df["Age Range"] = pd.cut(data_df["Age"], bins, labels=labels)
data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40-44
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [37]:
by_age = data_df.groupby(["Age Range"])
by_age.count()

           Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Range
Under 10            23   23   23      23       23         23     23
10-14               28   28   28      28       28         28     28
15-19              136  136  136     136      136        136    136
20-24              365  365  365     365      365        365    365
25-29              101  101  101     101      101        101    101
30-34               73   73   73      73       73         73     73
35-39               41   41   41      41       41         41     41
40-44               12   12   12      12       12         12     12
45-49                1    1    1       1        1          1      1

In [38]:
by_age["Price"].sum()

Age Range
Under 10      77.13
10-14         82.78
15-19        412.89
20-24       1114.06
25-29        293.00
30-34        214.00
35-39        147.67
40-44         36.54
45-49          1.70
Name: Price, dtype: float64

In [39]:
by_age["Price"].mean()

Age Range
Under 10    3.353478
10-14       2.956429
15-19       3.035956
20-24       3.052219
25-29       2.900990
30-34       2.931507
35-39       3.601707
40-44       3.045000
45-49       1.700000
Name: Price, dtype: float64

In [40]:
by_age["SN"].nunique()

Age Range
Under 10     17
10-14        22
15-19       107
20-24       258
25-29        77
30-34        52
35-39        31
40-44        11
45-49         1
Name: SN, dtype: int64

In [41]:
age_avg = by_age["Price"].sum() / by_age["SN"].nunique()
age_avg

Age Range
Under 10    4.537059
10-14       3.762727
15-19       3.858785
20-24       4.318062
25-29       3.805195
30-34       4.115385
35-39       4.763548
40-44       3.321818
45-49       1.700000
dtype: float64

## Age Analysis
Players who made purchases ranged in age from 7 to 45. The bulk of purchases - 602 in all, or 77 percent - were made by players between the ages of 15 and 29. The 20-24 age bracket had the largest share of spending: 47 percent of the overall total.

In [42]:
by_age_df = pd.DataFrame({
    "Age Range": ["Under 10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40-44", "45-49"],
    "No. of Purchases": ["23", "28", "136", "365", "101", "73", "41", "12", "1"],
    "Total Purchases": ["$77.13", "$82.78", "$412.89", "$1,114.06", "$293.00", "$214.00", "$147.67", "$36.54", "$1.70"],
    "Avg. Purchase": ["$3.53", "$2.95", "$3.03", "$3.05", "$2.90", "$2.93", "$3.60", "$3.05", "$1.70"],
    "Avg. Purchase per Person": ["$4.54", "$3.76", "$3.86", "$4.32", "$3.81", "$4.12", "$4.76", "$3.32", "$1.70"],
})
by_age_df

,Age Range,No. of Purchases,Total Purchases,Avg. Purchase,Avg. Purchase per Person
0,Under 10,23,$77.13,$3.53,$4.54
1,10-14,28,$82.78,$2.95,$3.76
2,15-19,136,$412.89,$3.03,$3.86
3,20-24,365,"$1,114.06",$3.05,$4.32
4,25-29,101,$293.00,$2.90,$3.81
5,30-34,73,$214.00,$2.93,$4.12
6,35-39,41,$147.67,$3.60,$4.76
7,40-44,12,$36.54,$3.05,$3.32
8,45-49,1,$1.70,$1.70,$1.70

In [153]:
data_df["SN"].value_counts().head()

Lisosia93      5
Iral74         4
Idastidru52    4
Iskadarya95    3
Phaena87       3
Name: SN, dtype: int64

In [94]:
spender_id = data_df[data_df["SN"] == "Chamjask73"]
spender_id

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
222,222,Chamjask73,22,Female,178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,20-24
520,520,Chamjask73,22,Female,109,"Downfall, Scalpel Of The Emperor",4.76,20-24
564,564,Chamjask73,22,Female,52,Hatred,4.84,20-24

In [95]:
spender_id["Price"].sum()

13.83

In [96]:
spender_id["Price"].mean()

4.61

In [125]:
purchase_amt = pd.DataFrame(data_df.groupby('SN')['Price'].sum())
purchase_amt.sort_values("Price", ascending=False).head()

             Price
SN
Lisosia93    18.96
Idastidru52  15.45
Chamjask73   13.83
Iral74       13.62
Iskadarya95  13.10

## Top Spenders
The five top spenders purchased at least three items and spent on average $14.99.

In [154]:
spender_df = pd.DataFrame({
    "SN": ["Lisosia93", "Idastidru52", "Iral74", "Chamjask73", "Iskadarya95"],
    "Purchase Count": ["5", "4", "4", "3", "3"],
    "Total Purchases": ["$18.96", "$15.45", "$13.83", "$13.62", "$13.10"],
    "Avg. Purchase": ["$3.79", "$3.86", "$4.61", "$3.41", "$4.37"],
})
spender_df

            SN Purchase Count Total Purchases Avg. Purchase
0    Lisosia93              5          $18.96         $3.79
1  Idastidru52              4          $15.45         $3.86
2       Iral74              4          $13.83         $4.61
3   Chamjask73              3          $13.62         $3.41
4  Iskadarya95              3          $13.10         $4.37

In [102]:
data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40-44
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [141]:
popular_items = data_df["Item ID"].value_counts()
popular_items.head()

178    12
82      9
108     9
145     9
92      8
Name: Item ID, dtype: int64

In [118]:
find_item = data_df[data_df["Item ID"] == 92]
find_item

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
252,252,Tyaelo67,39,Male,92,Final Critic,4.88,35-39
273,273,Phyali88,15,Female,92,Final Critic,4.88,15-19
277,277,Ennalmol65,24,Male,92,Final Critic,4.88,20-24
712,712,Lisilsa62,25,Male,92,Final Critic,4.88,25-29
722,722,Ilarin91,22,Male,92,Final Critic,4.88,20-24
767,767,Ilmol66,8,Female,92,Final Critic,4.88,Under 10
768,768,Assassasta79,38,Male,92,Final Critic,4.88,35-39

In [119]:
find_item["Price"].sum()

39.04

In [129]:
most_popular = pd.DataFrame({
    "Item ID": ["178", "82", "108", "145", "92"],
    "Item Name": ["Oathbreaker, Last Hope of the Breaking Storm", "Nirvana", "Extraction, Quickblade Of Trembling Hands", "Fiery Glass Crusader", "Final Critic"],
    "No. Purchased": ["12", "9", "9", "9", "8"],
    "Price": ["$4.23", "$4.90", "$3.53", "$4.58", "$4.88" ],
    "Total Sales": ["$50.76", "$44.10", "$31.77", "$41.22", "$39.04"],
})

In [130]:
#Note: The item called "Final Critic" had 13 sales. Two items, same name?
# It was listed with two different ID numbers and two prices.
most_popular

,Item ID,Item Name,No. Purchased,Price,Total Sales
0,178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
1,82,Nirvana,9,$4.90,$44.10
2,108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
3,145,Fiery Glass Crusader,9,$4.58,$41.22
4,92,Final Critic,8,$4.88,$39.04

## Item Analysis
Of the five items in the most popular table (above), four are also in the most profitable table (see below). The item "Singed Scalpel" replaced "Extraction, Quickblade of Trembling Hands" because of its higher purchase price.

In [124]:
profit_amt = pd.DataFrame(data_df.groupby('Item ID')['Price'].sum())
profit_amt.sort_values("Price", ascending=False).head()

         Price
Item ID
178      50.76
82       44.10
145      41.22
92       39.04
103      34.80

In [131]:
find_item = data_df[data_df["Item ID"] == 103]
find_item

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
175,175,Indcil77,17,Male,103,Singed Scalpel,4.35,15-19
373,373,Aina42,25,Male,103,Singed Scalpel,4.35,25-29
455,455,Lisossala30,20,Male,103,Singed Scalpel,4.35,20-24
460,460,Assistasda90,25,Male,103,Singed Scalpel,4.35,25-29
476,476,Marassa62,21,Male,103,Singed Scalpel,4.35,20-24
634,634,Eoral49,16,Male,103,Singed Scalpel,4.35,15-19
660,660,Isri34,38,Male,103,Singed Scalpel,4.35,35-39
714,714,Tyidaim51,16,Female,103,Singed Scalpel,4.35,15-19

In [133]:
find_item["Price"].sum()

34.8

In [136]:
most_profitable = pd.DataFrame({
    "Item ID": ["178", "82", "145", "92", "103"],
    "Item Name": ["Oathbreaker, Last Hope of the Breaking Storm", "Nirvana", "Fiery Glass Crusader", "Final Critic", "Singed Scalpel"],
    "No. Purchased": ["12", "9", "9", "8", "8"],
    "Price": ["$4.23", "$4.90", "$4.58", "$4.88", "$4.35"],
    "Total Sales": ["$50.76", "$44.10", "$41.22", "$39.04", "$34.80"],
})
most_profitable

,Item ID,Item Name,No. Purchased,Price,Total Sales
0,178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
1,82,Nirvana,9,$4.90,$44.10
2,145,Fiery Glass Crusader,9,$4.58,$41.22
3,92,Final Critic,8,$4.88,$39.04
4,103,Singed Scalpel,8,$4.35,$34.80